In [328]:
import numpy as np
import pandas as pd

####tabular data structure
####ordered collection of columns
####each column can be of a different type - numeric, string, boolean
####row and column index

In [329]:
#WA = Western Australia, NSW = New South Wales

In [330]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
     'year': [2000, 2001, 2002, 2001, 2002],
     'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

##Question: What is the type of "data"?

In [331]:
print data
print type(data)

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 'pop': [1.5, 1.7, 3.6, 2.4, 2.9], 'year': [2000, 2001, 2002, 2001, 2002]}
<type 'dict'>

####The type of 'data' is a data dictionary

In [332]:
#TODO convert data to a data frame
#TODO display the data frame (do not use print)
df = pd.DataFrame(data)
df

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

##Question: What do you notice about the index?
##Question: What do you notice about the ordering of the columns?

####The index was automatically assigned during the creation of the data frame
####The columns are displayed in alphabetical order from left to right

In [333]:
#TODO using the same column names re-order the columns to be "year", "state", "pop"

In [334]:
df=pd.DataFrame(data, columns=['year', 'state', 'pop'])
df

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [335]:
#TODO add the following index ['one', 'two', 'three', 'four', 'five'] and display the data frame

In [336]:
df.index = ['one', 'two', 'three', 'four', 'five']
df

       year   state  pop
one    2000    Ohio  1.5
two    2001    Ohio  1.7
three  2002    Ohio  3.6
four   2001  Nevada  2.4
five   2002  Nevada  2.9

In [337]:
#TODO redefine a new data frame using columns = ['year', 'state', 'pop', 'debt'],
#and index = ['one', 'two', 'three', 'four', 'five'] and display it
#Note carefully that this creates a columns of 'NaN's

In [338]:
df1=pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], index=['one', 'two', 'three', 'four', 'five'])
df1

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [339]:
####Each column is a Series, which is a pandas data structure in it's own right.
####There a number of notations used to access the columns of a data frame

In [340]:
#TODO Display the state column using 1. square bracket notation, and 2. dot notation

In [341]:
df1['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [342]:
df1.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [343]:
#TODO print out the types of data frame, 
#the column using bracket notation, and the column using dot notation

In [344]:
print type(df1)
print type(df1['state'])
print type(df.state)

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [345]:
#TODO Display the third row of the data frame

In [346]:
df1.ix['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

####The row is displayed as a column, in the heat of battle (with your data), this can be extraoridinarily confusing

In [347]:
#TODO Set the debt column to a scalar (e.g. 5.6), and redisplay the data frame

In [348]:
df1['debt'] = 5.6
df1

       year   state  pop  debt
one    2000    Ohio  1.5   5.6
two    2001    Ohio  1.7   5.6
three  2002    Ohio  3.6   5.6
four   2001  Nevada  2.4   5.6
five   2002  Nevada  2.9   5.6

In [349]:
#TODO now set the debt to the states as increasing integers, starting at 0 - a single
#line of code, and redisplay the data frame

In [350]:
df['debt'] = np.arange(5.)
df

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

####If you do assign a list or an array to a column then the length of the list or array must match the length of the column
####Assigning a Series is different

In [351]:
#TODO create a new Series using this data [-1.2, -1.5, -1.7] and 
#an index of ['two', 'four', 'five]. Display the Series

In [352]:
s = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
s

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [353]:
#TODO assign this Series to the 'debt' column of your data frame and redisplay

In [354]:
df['debt']=s
df

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

####This is extremely important functionality and is particularly applicable to time series analysis
####Consider if the index were times, and you are trying to merge time-aligned data
####Not only will the indexing take care of order your time-sensitive data, but where not data exists for a time an appropriate 'NaN' is created

In [355]:
#TODO Create a new column called eastern. This column will contain boolean values based on 
#whether the state is on the west coast or east coast of Australia. Create the column using
#a boolean expression based up on the fact that 'NSW' is east coast and 'WA' west coast. 
#Redisplay

In [356]:
df1['eastern'] = df.state == 'NSW'
df1

       year   state  pop  debt eastern
one    2000    Ohio  1.5   5.6   False
two    2001    Ohio  1.7   5.6   False
three  2002    Ohio  3.6   5.6   False
four   2001  Nevada  2.4   5.6   False
five   2002  Nevada  2.9   5.6   False

In [357]:
#TODO Delete the 'eastern' column and redisplay

In [358]:
del df1['eastern']
df1

       year   state  pop  debt
one    2000    Ohio  1.5   5.6
two    2001    Ohio  1.7   5.6
three  2002    Ohio  3.6   5.6
four   2001  Nevada  2.4   5.6
five   2002  Nevada  2.9   5.6

####As we have seen before!!
####The column returned when indexing a Data Frame is called a 'view' on the data.
####It is NOT a copy of the data
####If you modify the column then the underlying data will also be modified
####To copy the data you must explicitely use the copy method

In [359]:
debt_column = df1['debt']
debt_column[:] = 34
print debt_column
print df1

one      34
two      34
three    34
four     34
five     34
Name: debt, dtype: float64
       year   state  pop  debt
one    2000    Ohio  1.5    34
two    2001    Ohio  1.7    34
three  2002    Ohio  3.6    34
four   2001  Nevada  2.4    34
five   2002  Nevada  2.9    34

/Users/mrgholt/anaconda/lib/python2.7/site-packages/IPython/kernel/__main__.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  from IPython.kernel.zmq import kernelapp as app

In [360]:
debt_column = df1['debt'].copy()
debt_column[:] = 64
print debt_column
print df1

one      64
two      64
three    64
four     64
five     64
Name: debt, dtype: float64
       year   state  pop  debt
one    2000    Ohio  1.5    34
two    2001    Ohio  1.7    34
three  2002    Ohio  3.6    34
four   2001  Nevada  2.4    34
five   2002  Nevada  2.9    34

In [361]:
#TODO Create a nested dictioinary of dictionary of dictionaries using the following data:
#Victoria 2001 4.9  Victoria 2002 5.2  Tasmania 2000 0.498  Tasmania 2001 0.499 
#Tasmania 2002 0.501

In [362]:
pop = {'Victoria': {2001: 4.9, 2002: 5.2}, 'Tasmania': {2000: 0.498, 2001:0.499, 2002: 0.501}}

In [363]:
#TODO Now convert the dictionary of dictionaries to a data frame and display it

In [364]:
df2 = pd.DataFrame(pop)
df2

      Tasmania  Victoria
2000     0.498       NaN
2001     0.499       4.9
2002     0.501       5.2

##Question:
##The outer dictionary keys become ... of the data frame
##The inner dictionary keys become ... of the data frame

####The outer dictionary keys become the columns of the data frame
####The innner dictionary keys become the rows of the data frame

In [365]:
df3 = pd.DataFrame({'state': ['WA', 'WA', 'WA', 'NSW', 'NSW'], 
                    'year': [2010, 2011, 2012, 2013, 2014], 
                    'pop': [2.3, 2.4, 2.5, 7.5, 7.3]})
df3

   pop state  year
0  2.3    WA  2010
1  2.4    WA  2011
2  2.5    WA  2012
3  7.5   NSW  2013
4  7.3   NSW  2014

In [366]:
#TODO Delete the year column

In [367]:
del df3['year']

In [368]:
#TODO create a new index using the years and redisplay
#TODO try reindex instead of index and see what happens

In [369]:
df3.index = [2010, 2011, 2012, 2013, 2014]
df3

      pop state
2010  2.3    WA
2011  2.4    WA
2012  2.5    WA
2013  7.5   NSW
2014  7.3   NSW

In [370]:
#TODO Transpose the data frame and display

In [371]:
df3.T

      2010 2011 2012 2013 2014
pop    2.3  2.4  2.5  7.5  7.3
state   WA   WA   WA  NSW  NSW

In [372]:
#TODO print the last 2 rows of the data frame (using the data frame before the transpose
#exercise
#TODO print the last 2 populations for the state of WA

In [373]:
print df3[:-1]
print df3['pop'][df3.state=='WA'][1:]

      pop state
2010  2.3    WA
2011  2.4    WA
2012  2.5    WA
2013  7.5   NSW
2011    2.4
2012    2.5
Name: pop, dtype: float64

In [374]:
#TODO Change the index of the data frame to [2009, 2010, 2011, 2012, 2013, 2014, 2015] 
#using index
#TODO Change the index using reindex
#and redisplay

In [375]:
df3.index = [2009, 2010, 2011, 2012, 2013, 2014, 2015]
df3

ValueError: Length mismatch: Expected axis has 5 elements, new values have 7 elements

In [376]:
df3.reindex([2009, 2010, 2011, 2012, 2013, 2014, 2015])

      pop state
2009  NaN   NaN
2010  2.3    WA
2011  2.4    WA
2012  2.5    WA
2013  7.5   NSW
2014  7.3   NSW
2015  NaN   NaN

In [377]:
#TODO Redo the last exerise and forward fill the unknown values

In [378]:
df3.reindex([2009, 2010, 2011, 2012, 2013, 2014, 2015], method='ffill')

      pop state
2009  NaN   NaN
2010  2.3    WA
2011  2.4    WA
2012  2.5    WA
2013  7.5   NSW
2014  7.3   NSW
2015  7.3   NSW

In [379]:
#TODO Redo the last exerise and back fill the unknown values

In [380]:
df3.reindex([2009, 2010, 2011, 2012, 2013, 2014, 2015], method='bfill')

      pop state
2009  2.3    WA
2010  2.3    WA
2011  2.4    WA
2012  2.5    WA
2013  7.5   NSW
2014  7.3   NSW
2015  NaN   NaN

In [381]:
#TODO print just the population values

In [382]:
print df3['pop'].values

[ 2.3  2.4  2.5  7.5  7.3]

In [383]:
#TODO print just the values of the data frame itself

In [384]:
print df3.values

[[2.3 'WA']
 [2.4 'WA']
 [2.5 'WA']
 [7.5 'NSW']
 [7.3 'NSW']]

####All operations are built to IGNORE missing data (c.f. numpy library)

In [385]:
#Consider the following data frame
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], index=['a', 'b', 'c', 'd'], columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [386]:
#TODO print out the following:
#the data frame sum, where sum has no arguments
#the sum of the rows
#the sum of the columns
#the sum of the columns setting skipping NaNs to False
#the sum of the columns setting skipping NaNs to True

In [387]:
print df.sum()
print '--------------'
print df.sum(axis=0) #0 is ROWS
print '--------------'
print df.sum(axis=1) #1 is COLS
print '--------------'
print df.sum(axis=1, skipna=False)
print '--------------'
print df.sum(axis=1, skipna=True)

one    9.25
two   -5.80
dtype: float64
--------------
one    9.25
two   -5.80
dtype: float64
--------------
a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64
--------------
a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64
--------------
a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [388]:
#TODO Find the maximum values for the data frame
#TODO Find the indices for the maximum these

In [389]:
print df.max() #the maximum values
print '--------------'
print df.idxmax() #the indices for the maximum values
print '--------------'

one    7.1
two   -1.3
dtype: float64
--------------
one    b
two    d
dtype: object
--------------

####Other useful methods include: quantile, sum, mean, median, mad (mean absolute deviation), var, std ...

####These are computed from pairs of arguments
####corr and cov return a full correlation and covariance matrix as a data frame

In [390]:
pdf1 = pd.DataFrame([[1, 2], [3, 4], [5, 5], [1, 2], [2, 2], [3, 3]], columns=['x', 'y'])
pdf1

   x  y
0  1  2
1  3  4
2  5  5
3  1  2
4  2  2
5  3  3

In [391]:
#TODO Display the correlation matrix for the data frame

In [392]:
pdf1.corr()

          x         y
x  1.000000  0.938315
y  0.938315  1.000000

In [393]:
#TODO Display the covariance matrix for the data frame

In [394]:
pdf1.cov()

     x    y
x  2.3  1.8
y  1.8  1.6

In [395]:
####All descriptive statistics on pandas objects exclude missing data
####NaN represents missing data
####Remember NaN comes from the numpy library - hence np.NaN

In [396]:
da = pd.Series([1, 2, 3, 4, np.NaN, 6, 7, 8, np.NaN, 10])
da

0     1
1     2
2     3
3     4
4   NaN
5     6
6     7
7     8
8   NaN
9    10
dtype: float64

In [397]:
#TODO Filter out the NaNs using dropna and display the result

In [398]:
da.dropna()

0     1
1     2
2     3
3     4
5     6
6     7
7     8
9    10
dtype: float64

In [399]:
####or you can imput certain values

In [400]:
#TODO Impute the data mean into the missing values and display the Series

In [401]:
da.fillna(da.mean())

0     1.000
1     2.000
2     3.000
3     4.000
4     5.125
5     6.000
6     7.000
7     8.000
8     5.125
9    10.000
dtype: float64

In [402]:
#TODO Insert 0 into the missing values and display the Series

In [403]:
da.fillna(value = 0)

0     1
1     2
2     3
3     4
4     0
5     6
6     7
7     8
8     0
9    10
dtype: float64

#Now let's work on a real dataset

##A little pre-reading if you don't know about clicks and impressions and click-through-rateshttp://en.wikipedia.org/wiki/Click-through_rate

In [404]:
nyt_data = pd.read_csv("/Users/mrgholt/GADS-22-NYC/Datasets/nyt1.csv")

In [405]:
#TODO Describe the dataset

In [406]:
nyt_data.describe()

,Age,Gender,Impressions,Clicks,Signed_In
count,458441.000000,458441.000000,458441.000000,458441.000000,458441.000000
mean,29.482551,0.367037,5.007316,0.092594,0.700930
std,23.607034,0.481997,2.239349,0.309973,0.457851
min,0.000000,0.000000,0.000000,0.000000,0.000000
25%,0.000000,0.000000,3.000000,0.000000,0.000000
50%,31.000000,0.000000,5.000000,0.000000,1.000000
75%,48.000000,1.000000,6.000000,0.000000,1.000000
max,108.000000,1.000000,20.000000,4.000000,1.000000

In [407]:
#TODO List the types for each of the columns of data

In [408]:
nyt_data.dtypes

Age            int64
Gender         int64
Impressions    int64
Clicks         int64
Signed_In      int64
dtype: object

In [409]:
#TODO find the number of rows where individuals were not signed into the website,
#and the number where they were signed in

In [410]:
print nyt_data[nyt_data.Signed_In==0].count()
print nyt_data[nyt_data.Signed_In==1].count()

Age            137106
Gender         137106
Impressions    137106
Clicks         137106
Signed_In      137106
dtype: int64
Age            321335
Gender         321335
Impressions    321335
Clicks         321335
Signed_In      321335
dtype: int64

In [411]:
#TODO Remove the rows where users were NOT signed into the website

In [412]:
nyt_data = nyt_data[nyt_data.Signed_In==1]

In [413]:
#TODO Futher remove any rows where the number of impressions was 0, i.e. keep the records
#where the number of impressions was greater than zero

In [414]:
nyt_data = nyt_data[nyt_data.Impressions>0]

In [415]:
#TODO How many rows are left in the database?

In [416]:
nyt_data.count()

Age            319198
Gender         319198
Impressions    319198
Clicks         319198
Signed_In      319198
dtype: int64

In [417]:
#TODO List the first 10 lines of the data frame

In [418]:
nyt_data.head(10)

    Age  Gender  Impressions  Clicks  Signed_In
0    36       0            3       0          1
1    73       1            3       0          1
2    30       0            3       0          1
3    49       1            3       0          1
4    47       1           11       0          1
5    47       0           11       1          1
7    46       0            5       0          1
8    16       0            3       0          1
9    52       0            4       0          1
11   21       0            3       0          1

####Here is a way of creating an age group

####Firstly, write a Python function, which has a single input - age, and return as string - the age group

In [420]:
def age_grouping(age):
    '''This function inputs a single age and returns a string 
    which represents the age group within which the input age falls'''
    
    if age < 18:
        return "<18"
    elif age < 25:
        return "18-24"
    elif age < 35:
        return "25-34"
    elif age < 45:
        return "35-44"
    elif age < 55:
        return "45-54"
    elif age < 65:
        return "55-64"
    else:
        return "65+"

####Note the comment in the function
####This is called a doc string and it is good practice to include doc strings in all functions you write
####See what happens when you execute the following

In [421]:
help(age_grouping)

Help on function age_grouping in module __main__:

age_grouping(age)
    This function inputs a single age and returns a string
    which represents the age group within which the input age falls

####The apply function is an enormously helpful function built into the Pandas dataframe datastructure
####This can apply a function to 1 dimensional arrays, either a column or a row
####It requires the use of 'lamda' which is a Python construct. lambda is how Python implements anonymous functions, which are functions that are not bound to a name

In [422]:
####An example

In [423]:
#Take a list of ages
age_list = [17, 21, 55, 23, 43, 32, 78]

In [424]:
#We can insert the lambda into a list comprehension in order to process the list and send each
#member to the age_grouping function
[(lambda x: age_grouping(x))(age) for age in age_list]

['<18', '18-24', '55-64', '18-24', '35-44', '25-34', '65+']

####We could have done this

In [425]:
age_group_list=[]
for age in age_list:
    age_group_list.append(age_grouping(age))
print age_group_list

['<18', '18-24', '55-64', '18-24', '35-44', '25-34', '65+']

In [426]:
####Putting this altogether

In [427]:
nyt_data['Age_group'] = nyt_data.Age.apply(lambda x: age_grouping(x))

In [428]:
nyt_data.head(10)

    Age  Gender  Impressions  Clicks  Signed_In Age_group
0    36       0            3       0          1     35-44
1    73       1            3       0          1       65+
2    30       0            3       0          1     25-34
3    49       1            3       0          1     45-54
4    47       1           11       0          1     45-54
5    47       0           11       1          1     45-54
7    46       0            5       0          1     45-54
8    16       0            3       0          1       <18
9    52       0            4       0          1     45-54
11   21       0            3       0          1     18-24

In [429]:
for age_gp, subset in nyt_data.groupby('Age_group'):
    print age_gp, subset[subset.Clicks == subset.Clicks.max()].Impressions.values

18-24 [ 9  5  9  8  9  3  5 10  3  8  8  6  6  7  7  6  5  8  5 12  3 12  8  6  6
  6  4  6  6  8  8 11  9  5  7  6  8  8  7  7 11  4  6  4 13  6  8 10  9  6
 10  4  8  6  5  5 13 11  6  8]
25-34 [ 7  9 10  5  4  9  9 13  5 11  4  7  8 11  7  8  3  7  3 11 10  7  9  8  7
  7  8  9  8 11  5  9 12 12  6 12  3  7  7  5  8  9  8  9  4  3  6  6  7  8
  2  8  6  9  7  8  8  3  3  9 10  3  6  6  6  7  6]
35-44 [12]
45-54 [ 7 10  7  5  9  7  7  9  6  6  9  7  7  6  4  7  6  8  5  5 12 10  6 12  8
  9 11  8  5  5  6  4  7  8  6 10  7  7  5  9  9  4  7  8  5  9  7  9 10 10
  7  7  5  9  9  6  6  6  5  6  6  7  5  4 11  5  9 12 10  7  7  4  6  8  4
  8 11  7  6  8 10  7  4  6 11  7  7  8  6  7 11  5  9]
55-64 [11  8  9  6 11  5 11]
65+ [ 8  9  6 13  7  7  8  5  4  6 14  9]
<18 [ 6  7 10  7  7  7]

In [430]:
#TODO Create a new column called 'ctr' for click-through-rate and populate it with Clicks/Impressions

In [431]:
nyt_data['ctr'] = nyt_data.Clicks/nyt_data.Impressions

In [432]:
#TODO Show that the new column is a float

In [433]:
nyt_data.dtypes

Age              int64
Gender           int64
Impressions      int64
Clicks           int64
Signed_In        int64
Age_group       object
ctr            float64
dtype: object

In [434]:
#TODO Display the data frame utilizing the groupby function to show the counts of the ctr by age group

In [435]:
nyt_data[nyt_data.ctr>0].groupby('Age_group')['ctr'].count()

Age_group
18-24        2107
25-34        2870
35-44        3592
45-54        3139
55-64        4337
65+          4084
<18          1933
Name: ctr, dtype: int64

In [436]:
#TODO Display the data frame utilizing the groupby function to show the sums of the ctr by age group

In [437]:
nyt_data[nyt_data.ctr>0].groupby('Age_group')['ctr'].sum()

Age_group
18-24        433.729920
25-34        586.467943
35-44        724.095901
45-54        635.743708
55-64        902.881648
65+          851.045969
<18          415.766769
Name: ctr, dtype: float64

In [438]:
#TODO This presents the sum of the click through rates by age group, but does not take into account the differing
#numbers in each group
#TODO Redisplay the data frame by dividing by the count in each group

In [439]:
nyt_data[nyt_data.ctr>0].groupby('Age_group')['ctr'].sum()/nyt_data[nyt_data.ctr>0].groupby('Age_group')['ctr'].count()

Age_group
18-24        0.205852
25-34        0.204344
35-44        0.201586
45-54        0.202531
55-64        0.208181
65+          0.208385
<18          0.215089
Name: ctr, dtype: float64

In [440]:
#TODO display the correlation matrix for the data frame

In [441]:
nyt_data.corr()

                  Age    Gender  Impressions    Clicks  Signed_In       ctr
Age          1.000000 -0.079561     0.002215  0.064119        NaN  0.054507
Gender      -0.079561  1.000000    -0.000935 -0.005832        NaN -0.005829
Impressions  0.002215 -0.000935     1.000000  0.119612        NaN  0.000460
Clicks       0.064119 -0.005832     0.119612  1.000000        NaN  0.870216
Signed_In         NaN       NaN          NaN       NaN        NaN       NaN
ctr          0.054507 -0.005829     0.000460  0.870216        NaN  1.000000

In [442]:
#TODO Display the correlation coefficient between the Clicks and the ctr
#TODO Display the correlation coefficient between the ctr and Impressions

In [443]:
nyt_data['Clicks'].corr(nyt_data['ctr'])

0.87021600229179008

In [445]:
nyt_data['ctr'].corr(nyt_data['Impressions'])

0.00046044075124627992